Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Similarly, for all the repository operations, you can obtain alternate repositories for your entity from the generated metamodel accessors, or by injecting them with `@Inject`:
ja_jp: 同様に、すべてのリポジトリ操作に対して、生成されたメタモデルアクセサーからエンティティの代替リポジトリを取得したり、`@Inject` でそれらを注入したりできます。

source: Similarly, if it becomes necessary to test security features using both `@TestSecurity` and Bearer token authentication, you can leverage both like in the example below:
ja_jp: 同様に、 `@TestSecurity`とベアラートークン認証の両方を使用してセキュリティー機能をテストする必要がある場合、 以下の例のように両方を活用できます。

source: Similarly, if the request URL is `http://localhost:8080/service/2`, then the `redirect_uri` parameter is set to `http://localhost:8080/service/2`.
ja_jp: 同様に、リクエスト URL が `http://localhost:8080/service/2` の場合、 `redirect_uri` パラメーターは `http://localhost:8080/service/2` に設定されます。

source: Similarly, if you declare
ja_jp: 同様に、以下を宣言した場合

source: Similarly, if you use `mysql`, the name of the datasource can be specified as follows:
ja_jp: 同様に、`mysql` を使う場合は、データソース名を以下のように指定することができます。

source: Similarly, if you want to use a `password` or `client_credentials` grant for Dev UI to acquire the tokens, then you might need to configure some extra provider-specific properties, for example:
ja_jp: 同様に、Dev UI に `password` または `client_credentials` グラントを使用してトークンを取得する場合は、プロバイダー固有の追加のプロパティーを設定する必要がある場合があります。次に例を示します。

source: Similarly, if you'd like to use a `password` or `client_credentials` grant for Dev UI to acquire the tokens then you may have to configure some extra provider specific properties, for example:
ja_jp: 同様に、Dev UI に `password` または `client_credentials` グラントを使用してトークンを取得する場合は、次のような追加のプロバイダー固有プロパティーを設定する必要があります。

source: Similarly, response filters can be declared with the link:{resteasy-reactive-api}/org/jboss/resteasy/reactive/server/ServerResponseFilter.html[`@ServerResponseFilter`] annotation:
ja_jp: 同様に、レスポンスフィルターは link:{resteasy-reactive-api}/org/jboss/resteasy/reactive/server/ServerResponseFilter.html[`@ServerResponseFilter`] アノテーションで宣言できます。

source: Similarly, the login flow is a little different because you will write your own login endpoint which will handle updating the credentials and setting up the session cookie:
ja_jp: 同様に、ログインフローも少し異なります。独自のログインエンドポイントを作成するためです。 このログインエンドポイントは、認証情報の更新とセッション Cookie のセットアップを処理します。

source: Similarly, the method `updateAsync` returns a `Uni` - it is automatically converted from the original result set returned by the driver.
ja_jp: 同様に、メソッド `updateAsync` は `Uni` を返します。これは、ドライバーが返す元の結果セットから自動的に変換されます。

source: Similarly, two redundant definitions, e.g. defining an injection from the same secret twice, will not cause an issue but will indeed report a warning to let you know that you might not have intended to duplicate that definition.
ja_jp: 同様に、同じシークレットからのインジェクションを2回定義するなど、2つの冗長な定義があっても問題は発生しませんが、その定義を複製することを意図していなかった可能性があることを知らせる警告が実際に報告されます。

source: Similarly, two redundant definitions, for example, defining an injection from the same secret twice, does not cause an issue but reports a warning to inform you that you might not have intended to duplicate that definition.
ja_jp: 同様に、2つの冗長な定義、例えば同じシークレットからのインジェクションを2回定義しても問題は発生しませんが、その定義を重複させる意図はなかったかもしれないという警告が表示されます。

source: Similarly, we can get a backtrace of the call graph of other threads.
ja_jp: 同様に、他のスレッドのコールグラフのバックトレースを取得できます。

source: Similarly, we can modify the `my-extension-project/foo/pom.xml` and then simply run `mvn clean test -Djacoco`. When the build is finished, we can analyze the code coverage reports in the `my-extension-project/target/coverage` directory.
ja_jp: 同様に `my-extension-project/foo/pom.xml` を修正し、`mvn clean test -Djacoco` を実行するだけです。ビルドが完了すると、`my-extension-project/target/coverage` ディレクトリにあるコードカバレッジレポートを分析できます。

source: Similarly, whenever your endpoint method takes an object as parameter, we will look for a way to map the HTTP request body into that object.
ja_jp: 同様に、エンドポイントメソッドがオブジェクトをパラメーターとして受け取る場合は常に、HTTP リクエストの本文をそのオブジェクトにマッピングする方法を探します。

source: Similarly, you can `PUT` two different representations. JSON:
ja_jp: 同様に、2 つの異なる表現を PUT することができます。JSON:

source: Simple Bean Example
ja_jp: シンプルなBeanの例

source: Simple Decorator Example
ja_jp: シンプルなデコレーターの例

source: Simple Event Example
ja_jp: シンプルなイベントの例

source: Simple Example
ja_jp: 簡単な例

source: Simple Example of Interceptor Usage
ja_jp: シンプルなインターセプターの使用例

source: Simple Interceptor Binding Example
ja_jp: シンプルなインターセプターバインディングの例

source: Simple Interceptor Example
ja_jp: シンプルなインターセプターの例

source: Simple PicocliApplication with only one `Command` can be created as follows:
ja_jp: `Command` を 1 つだけ使ったシンプルな PicocliApplication は、以下のように作成できます。

source: Simple SAM Local Principal
ja_jp: 単純な SAM ローカルプリンシパル

source: Simple `application.properties` with form-base authentication can look similar to this:
ja_jp: フォームベース認証を使用した単純な `application.properties` は次のようになります。

source: Simple application
ja_jp: シンプルなアプリケーション

source: Simple authorizaion code flow support
ja_jp: シンプルな認可コードフローのサポート

source: Simple bearer access token support
ja_jp: シンプルなベアラーアクセストークンのサポート

source: Simple build items
ja_jp: シンプルなビルドアイテム

source: Simple build items are final classes which extend `io.quarkus.builder.item.SimpleBuildItem`. Simple build items may only be produced by one step in a given build; if multiple steps in a build declare that they produce the same simple build item, an error is raised. Any number of build steps may consume a simple build item. A build step which consumes a simple build item will always run _after_ the build step which produced that item.
ja_jp: シンプルビルドアイテムは `io.quarkus.builder.item.SimpleBuildItem` を拡張したfinalクラスです。シンプルビルドアイテムは、特定のビルドにおいて、1つのステップでのみ作成できます。ビルド内の複数のステップが同じシンプルビルドアイテムを生成すると宣言した場合、エラーが発生します。シンプルビルドアイテムを利用するビルドステップは、常にそのアイテムを生成したビルドステップの _後に_ 実行されます。

source: Simple client (probably what most users need).
ja_jp: シンプルなクライアント (おそらくほとんどのユーザーが必要としているもの)。

source: Simple code
ja_jp: シンプルなコード

source: Simple command line application
ja_jp: シンプルなコマンドラインアプリケーション

source: Simple component test
ja_jp: シンプルなコンポーネントテスト

source: Simple component test with programmatic configuration
ja_jp: プログラムによる設定を使用したシンプルなコンポーネントテスト

source: Simple component test with test method parameters
ja_jp: テストメソッドパラメーターを使用したシンプルなコンポーネントテスト

source: Simple message
ja_jp: シンプルなメッセージ

source: Simple string field values
ja_jp: 単純な文字列フィールド値

source: Simpler parameter and context injection
ja_jp: よりシンプルなパラメーターとコンテキストインジェクション

source: Simplified Constructor Injection
ja_jp: 簡略化されたコンストラクター注入

source: Simplified Hibernate ORM with Panache and Kotlin
ja_jp: Simplified Hibernate ORM with PanacheとKotlin

source: Simplified Hibernate Reactive with Panache
ja_jp: PanacheでシンプルになったHibernate Reactive

source: Simplified Hibernate with Panache Next
ja_jp: Panache Next を使用した Hibernate の簡素化

source: Simplified MongoDB with Panache
ja_jp: シンプルになったMongoDB with Panache

source: Simplified MongoDB with Panache and Kotlin
ja_jp: シンプルになったMongoDB with PanacheとKotlin

source: Simplified Producer Method Declaration
ja_jp: 簡略化された Producer メソッドの宣言

source: Simplified logging
ja_jp: 簡易ロギング

source: Simplified queries
ja_jp: シンプルなクエリー

source: Simplified reactive ORM layer based on Hibernate Reactive.
ja_jp: Hibernate ReactiveをベースにしたシンプルになったリアクティブORMレイヤー。

source: Simplify command line applications creation with the Picocli extension.
ja_jp: Picocli エクステンションでコマンドラインアプリケーションの作成を簡素化します。

source: Simplifying Hibernate ORM with Panache
ja_jp: Simplified Hibernate ORM with Panache

source: Simplifying Hibernate Reactive with Panache
ja_jp: PanacheでHibernate Reactiveをシンプルに

source: Simplifying MongoDB Client usage using BSON codec
ja_jp: BSON codecを使ってMongoDBクライアントの利用をシンプルにする

source: Simplifying MongoDB with Panache
ja_jp: PanacheでMongoDBをシンプルにする

source: Simplifying complex logic
ja_jp: 複雑なロジックの簡略化

source: Simply inject the Meter registry into your code -- it will periodically push metrics to Grafana LGTM's OTLP HTTP endpoint.
ja_jp: Meter レジストリーをコードに注入するだけで、メトリクスが Grafana LGTM の OTLP HTTP エンドポイントに定期的にプッシュされるようになります。

source: Simply put, you don't control the lifecycle of the object instance directly. Instead, you can affect the lifecycle through declarative means, such as annotations, configuration, etc. The container is the _environment_ where your application runs. It creates and destroys the instances of beans, associates the instances with a designated context, and injects them into other beans.
ja_jp: 簡単に言えば、オブジェクトインスタンスのライフサイクルを直接制御することはできません。その代わりに、アノテーションや設定などの宣言的な手段でライフサイクルに影響を与えることができます。コンテナーはアプリケーションが動作する _環境_ です。コンテナーは、Beanのインスタンスを作成したり破棄したり、指定されたコンテキストにインスタンスを関連付けたり、他のBeanに注入したりします。

source: Simulate AWS Lambda Deployment with SAM CLI
ja_jp: SAM CLI を使用した AWS Lambda デプロイメントのシミュレート

source: Simulate Amazon Lambda Deployment with SAM CLI
ja_jp: SAM CLI を使用して Amazon Lambda のデプロイをシミュレートする

source: Since 0.3.0 of Kogito, there is an option to enable persistence to preserve process instance state across application restarts. That supports long running process instances that can be resumed at any point in time.
ja_jp: Kogito の 0.3.0 以降、アプリケーションの再起動時にプロセスインスタンスの状態を保持するために永続性を有効にするオプションがあります。これにより、いつでも再開できる長時間稼働しているプロセスインスタンスをサポートします。

source: Since 0.3.0 of Kogito, there is an option to enable persistence to preserve process instance state across application restarts. That supports long-running process instances that can be resumed at any point in time.
ja_jp: Kogito の 0.3.0 以降、アプリケーションの再起動時にプロセスインスタンスの状態を保持するために永続性を有効にするオプションがあります。これにより、いつでも再開できる長時間稼働しているプロセスインスタンスをサポートします。

source: Since CDI is the central programming model when it comes to component composition, frameworks and extensions should expose their components as beans that are easily consumable by user applications. For example, Hibernate ORM exposes `EntityManagerFactory` and `EntityManager` beans, the connection pool exposes `DataSource` beans etc. Extensions must register these bean definitions at build time.
ja_jp: CDI がコンポーネントの構成に関して中心的なプログラミングモデルであるため、フレームワークやエクステンションはそのコンポーネントを、ユーザアプリケーションが容易に消費できるBeanとして公開しなければなりません。例えば、Hibernate ORM は `EntityManagerFactory` と `EntityManager` の Bean を公開し、コネクションプールは `DataSource` のBeanを公開します。エクステンションは、ビルド時にこれらのBean定義を登録しなければなりません。

source: Since GraphQL API's returns data that are requested by the client adding additional fields and capabilities to existing API will not create breaking changes to existing clients.
ja_jp: GraphQL APIはクライアントから要求されたデータを返すので、既存のAPIにフィールドや機能を追加しても、既存のクライアントに大きな変更を加えることはありません。

source: Since Infinispan serializes data by default using Protobuf in Quarkus, executing the code will result in the following error:
ja_jp: Infinispan はデフォルトで Quarkus の Protobuf を使用してデータをシリアル化するため、コードを実行すると以下のエラーが発生します。

source: Since Mandrel 21.3.0.0, the call tree is also reported as a group of CSV files. The CSV output can be enabled by adding `-H:PrintAnalysisCallTreeType=CSV` to the additional native arguments. E.g.
ja_jp: Mandrel 21.3.0.0 以降、コールツリーも CSV ファイルのグループとして報告されます。CSV 出力は、追加のネイティブ引数に `-H:PrintAnalysisCallTreeType=CSV` を追加することで有効にできます。以下に例を示します。

source: Since Protostream 5.0, a single annotation is needed to generate a default mapping
ja_jp: Protostream 5.0以降、デフォルトのマッピングを生成するには1つのアノテーションが必要です。

source: Since Protostream 5.0, records are supported
ja_jp: Protostream 5.0 以降では、レコード型がサポートされています。

source: Since Quarkus 3.19, Quarkus is using UBI 9 as the default base image for container images. Given the oldest version we maintain in the community is 3.20 LTS, we have decided to retire the community UBI 8 images for Quarkus in March 2026.
ja_jp: Quarkus 3.19 以降、Quarkus はコンテナーイメージのデフォルトベースイメージとして UBI 9 を使用しています。コミュニティでメンテナンスしている最古のバージョンが 3.20 LTS であることを踏まえ、2026年3月に Quarkus 用コミュニティ版 UBI 8 イメージの提供を終了することを決定しました。

source: Since Quarkus 3.31.2 you can measure and analyze the code coverage for the runtime modules of Quarkus extensions. Improve the test suite, spot more bugs before the release, catch more regressions!
ja_jp: Quarkus 3.31.2 以降、Quarkus エクステンションのランタイムモジュールのコードカバレッジを測定し、分析できるようになりました。テストスイートを改善し、リリース前に多くのバグを発見し、より多くのリグレッションを捕捉しましょう。

source: Since Quarkus has built-in exception mappers for `jakarta.validation.ConstraintViolationException`, explicitly handling these exceptions might be redundant. See the xref:validation.adoc#rest-end-point-validation[REST end point validation] section of the Hibernate Validator guide for more details.
ja_jp: Quarkus には `jakarta.validation.ConstraintViolationException` 用の組み込み例外マッパーがあるため、これらの例外を明示的に処理することは冗長になる可能性があります。詳細は Hibernate Validator ガイドの xref:validation.adoc#rest-end-point-validation[REST エンドポイントのバリデーション] セクションを参照してください。

source: Since Quarkus, its extensions, and dependencies do not use the log4j version 2 core library, it is *NOT susceptible* to this vulnerability. In most cases, no corrective action is required for any Quarkus backed projects you may have. Quarkus does expose the log4j API jar which in itself is not vulnerable. This is purely a compatibility and translation layer, which maps calls to a different logging backend (JBoss Logging). Therefore, any direct usage of the log4j API is not impacted.
ja_jp: Quarkus、そのエクステンション、および依存関係は、log4jバージョン2のコアライブラリを使用していないため、この脆弱性の影響を受けることはありません。ほとんどの場合、Quarkusを使用したプロジェクトに修正措置は必要ありません。Quarkusはlog4j API jarを公開しており、それ自体は脆弱性ではありません。これは純粋に互換性と翻訳レイヤであり、異なるロギングバックエンド（JBoss Logging）への呼び出しをマッピングします。したがって、log4j APIを直接使用する場合は、影響を受けません。

source: Since `Deployment` is a Kubernetes resource and not OpenShift specific, it can't possibly leverage `ImageStream` resources, as is the case with `DeploymentConfig`. This means that the image references need to include the container image registry that hosts the image. When the image is built, using OpenShift builds (s2i binary and docker strategy) the OpenShift internal image registry `image-registry.openshift-image-registry.svc:5000` will be used, unless an other registry has been explicitly specified by the user. Please note, that in the internal registry the project/namespace name is added as part of the image repository: `image-registry.openshift-image-registry.svc:5000/<project name>/<name>:<tag>`, so users will need to make sure that the target project/namespace name is aligned with the `quarkus.container-image.group`.
ja_jp: `Deployment` は Kubernetes のリソースであり、OpenShift 固有のものではないため、 `DeploymentConfig` のように `ImageStream` のリソースを活用することはできません。つまり、イメージの参照には、イメージをホストするコンテナイメージレジストリを含める必要があります。 OpenShift のビルド（s2i バイナリと docker ストラテジー）を使用してイメージがビルドされると、OpenShift の内部イメージレジストリ `image-registry.openshift-image-registry.svc:5000` が使用されます。内部レジストリでは、プロジェクト/名前空間名がイメージリポジトリの一部として追加されることに注意してください： `image-registry.openshift-image-registry.svc:5000/<project name>/<name>:<tag>` そのため、ユーザーは対象のプロジェクト/名前空間名が `quarkus.container-image.group` と一致していることを確認する必要があります。

source: Since `Deployment` is a Kubernetes resource and not OpenShift specific, it can't possibly leverage `ImageStream` resources, as is the case with `DeploymentConfig`. This means that the image references need to include the container image registry that hosts the image. When the image is built, using OpenShift builds (s2i binary and docker strategy) the OpenShift internal image registry `image-registry.openshift-image-registry.svc:5000` will be used, unless another registry has been explicitly specified by the user. Please note, that in the internal registry the project/namespace name is added as part of the image repository: `image-registry.openshift-image-registry.svc:5000/<project name>/<name>:<tag>`, so users will need to make sure that the target project/namespace name is aligned with the `quarkus.container-image.group`.
ja_jp: `Deployment` はKubernetesのリソースであり、Openshift固有のものではないため、 `DeploymentConfig` のように `ImageStream` のリソースを活用することはできません。このため、イメージの参照には、イメージをホストするコンテナイメージレジストリを含める必要があります。イメージがビルドされる際、Openshift のビルド（s2i バイナリおよび docker 戦略）を使用する場合、ユーザーが他のレジストリを明示的に指定していない限り、Openshift の内部イメージレジストリ `image-registry.openshift-image-registry.svc:5000` が使用されます。内部レジストリでは、プロジェクト/名前空間名がイメージリポジトリの一部として追加されることに注意してください： `image-registry.openshift-image-registry.svc:5000/<project name>/<name>:<tag>` したがって、ユーザーはターゲットのプロジェクト/名前空間名が `quarkus.container-image.group` と一致していることを確認する必要があります。

source: Since `format` is not defined in these properties, the default value from `@ConfigItem` will be used instead.
ja_jp: これらのプロパティーでは `format` が定義されていないため、代わりに `@ConfigItem` のデフォルト値が使用されます。

source: Since `format` is not defined in these properties, the default value from `@WithDefault` will be used instead.
ja_jp: これらのプロパティには `format` が定義されていないため、代わりに `@WithDefault` のデフォルト値が使用されます。

source: Since an Uber JAR is published as a Maven artifact itself, SBOMs generated for Uber JARs will also be automatically published as Maven artifacts. This, however, can be disabled by setting the `attachSboms` parameter of the `quarkus:build` goal to `false`.
ja_jp: Uber JAR は Maven アーティファクトとして公開されるため、Uber JAR 用に生成された SBOM も自動的に Maven アーティファクトとして公開されます。ただし、 `quarkus:build` ゴールの `attachSboms` パラメーターを `false` に設定することで、これを無効にできます。

source: Since books are "owned" by authors (they are duplicated for each author and their lifecycle is bound to their author's), adding/deleting a book is simply an update to the author.
ja_jp: book は author によって "所有" されるため ( author ごとに複製され、そのライフサイクルは author のライフサイクルにバインドされます)、 book の追加/削除は、単なる author への更新になります。

source: Since coordinators are just JAX-RS applications they can be embedded with JAX-RS services quite easily by adding the LRA coordinator dependency the applications pom.xml file:
ja_jp: コーディネーターは単なるJAX-RSアプリケーションなので、アプリケーションのpom.xmlファイルにLRAコーディネーターの依存関係を追加することで、JAX-RSサービスに簡単に組み込むことができます。

source: Since it converts the same value type (`MicroProfileCustomValue`) and has a priority of `150`, it will be used instead of a `MicroProfileCustomValueConverter` which has a default priority of `100`.
ja_jp: 同値の型 ( `MicroProfileCustomValue`)を変換し、優先度が `150` であるため、デフォルトの優先度が `100` である `MicroProfileCustomValueConverter` の代わりに使用されます。

source: Since native executables are not currently attached to projects as Maven artifacts, their SBOMs will not be attached as Maven artifacts either.
ja_jp: 現在、ネイティブ実行可能ファイルは Maven アーティファクトとしてプロジェクトにアタッチされないため、その SBOM も Maven アーティファクトとしてアタッチされません。

source: Since optimal performance is never an objective of dev mode, in the interest of improving startup time, the JVM's C2 compiler is disabled in dev mode.
ja_jp: 最適なパフォーマンスはdevモードの目的では決してないため、起動時間を改善する目的で、JVMのC2コンパイラーはdevモードでは無効になっています。

source: Since our query contains all the fields in the `Film` class we will retrieve all the fields in our response. Since GraphQL API responses are client determined, the client can choose which fields it will require.
ja_jp: クエリには `Film` クラスのすべてのフィールドが含まれているので、レスポンスではすべてのフィールドを取得します。GraphQL APIのレスポンスはクライアントが決めるものなので、クライアントはどのフィールドを必要とするかを選択することができます。

source: Since reading ConfigMaps involves interacting with the Kubernetes API Server, when https://kubernetes.io/docs/reference/access-authn-authz/rbac/[RBAC] is enabled on the cluster, the https://kubernetes.io/docs/tasks/configure-pod-container/configure-service-account/[ServiceAccount] that is used to run the application needs to have the proper permissions for such access.
ja_jp: ConfigMapsの読み込みにはKubernetes API Serverとのやりとりが含まれるため、クラスター上で link:https://kubernetes.io/docs/reference/access-authn-authz/rbac/[RBAC] が有効になっている場合、アプリケーションを実行するために使用される link:https://kubernetes.io/docs/tasks/configure-pod-container/configure-service-account/[ServiceAccount] に適切なアクセス権限が必要になります。

source: Since the CDI container does not control the instantiation of a synthetic bean the dependency injection and other services (such as interceptors) are not supported. In other words, it's up to the extension to provide all required services to a synthetic bean instance.
ja_jp: CDIコンテナは合成Beanのインスタンス化を制御しないので、依存性注入や他のサービス(インターセプタなど)はサポートされていません。言い換えれば、合成 Bean のインスタンスに必要なすべてのサービスを提供するのはエクステンション次第ということです。

source: Since the `mockableBean2` mock has not been configured, it will return the default Mockito response.
ja_jp: `mockableBean2` のモックが設定されていないので、デフォルトの Mockito レスポンスを返します。

source: Since the `value` property in the entity has no constraints, there are no additional constraints in the DDL, and the `255` length limit comes from the default `jakarta.persistence.Column#lenght()`.
ja_jp: エンティティの `value` プロパティーには制約がないため、DDL に追加の制約はありません。また、 `255` という長さの制限は、デフォルトの `jakarta.persistence.Column#lenght()` に由来します。

source: Since the `value` property in the entity has no constraints, there are no additional constraints in the DDL, and the `255` length limit comes from the default `jakarta.persistence.Column#length()`.
ja_jp: エンティティーの `value` プロパティーには制約がないため、DDL に追加の制約は含まれず、`255` という長さ制限はデフォルトの `jakarta.persistence.Column#length()` に由来します。

source: Since the commit was successful the changes made by the flight and taxi services are now visible to other threads. Note that other transactions that relied on the old state may or may not now incur conflicts when they commit (the STM library provides a number of features for managing conflicting behaviour and these are covered in the Narayana STM manual).
ja_jp: コミットが成功したので、フライトサービスやタクシーサービスで行われた変更が他のスレッドからも見えるようになりました。古い状態に依存していた他のトランザクションがコミットする際に競合が発生する可能性があることに注意してください (STM ライブラリーは競合する動作を管理するための多くの機能を提供しており、これらについては Narayana STM マニュアルに記載されています)。

source: Since the coordinator is just a JAX-RS resource we can build one using quarkus, adding the `resteasy-jackson` and `rest-client` extensions:
ja_jp: コーディネーターは単なるJAX-RSリソースなので、Quarkusを使って、 `resteasy-jackson` と `rest-client` のエクステンションを追加して構築することができます。

source: Since the creation of Quarkus (3 years ago), link:#existing-articles[many blog articles] have popped up to help in that matter, most of them taking advantage of the frontend-maven-plugin. As the creator of code.quarkus.io, I have also been confronted with this situation and I, like many others, have filled the gap using this plugin. It does the job for sure and has been good enough to fill the need for the time being. Unfortunately the overall process could be more streamlined and easier to get started with, it involves a lot of configuration, some tricky setup to copy the resources to the right place and test the frontend at the right moment. Live coding requires starting two processes and a proxy to make it work together.
ja_jp: Quarkusが誕生して以来（3年前）、この問題を解決するために link:#existing-articles[多くのブログ記事] が作成されましたが、そのほとんどはfrontend-maven-pluginを利用したものでした。code.quarkus.ioの作成者として、私もこの状況に直面し、他の多くの人と同様に、このプラグインを使用してギャップを埋めました。このプラグインは確かに仕事をし、当面のニーズを満たすには十分でした。残念ながら、全体的なプロセスはもっと合理的で簡単に始められるはずです。多くの設定、リソースを正しい場所にコピーするためのトリッキーなセットアップ、適切なタイミングでフロントエンドをテストすることが必要です。ライブコーディングでは、2つのプロセスを起動し、それを一緒に動作させるためのプロキシが必要です。

source: Since the https://quarkus.io/blog/ja-quarkus-io/[launch] of Japanese https://ja.quarkus.io[ja.quarkus.io], we got contributors translating the website into (simplified) Chinese at https://cn.quarkus.io[cn.quarkus.io] and recently we added Spanish at https://es.quarkus.io[es.quarkus.io] too.
ja_jp: 日本語版 link:https://ja.quarkus.io[ja.quarkus.io] のlink:https://quarkus.io/blog/ja-quarkus-io/[開設] 以来、中国語（簡体字）版 link:https://cn.quarkus.io[cn.quarkus.io] 、そして最近ではスペイン語版 link:https://es.quarkus.io[es.quarkus.io] を追加しました。
